#### A function is a set of code that performs some task

In [ ]:
#syntax
#def function_name():
#     statement(s)

In [2]:
def addition(a,b): #a, b are arguments (* formal arguments)- position, keyword,default
    c=a+b
    return c

In [3]:
addition(4,5)

9

In [4]:
def add_mult(a,b):
    c=a+b
    d=a*b
    return c,d

In [5]:
add_mult(3,5) #(actual arguments)

(8, 15)

In [6]:
o_p1,o_p2 = add_mult(3,5)

In [7]:
o_p1

8

In [8]:
o_p2

15

In [9]:
def facebook(name,age=25): #default
    print(name)
    print(age)

In [10]:
facebook('Narmada',28)

Narmada
28

In [12]:
facebook(name='Kavya') #keyword arguments

Kavya
25

In [13]:
def addition(a, *b): #variable length

    return a, b

In [14]:
addition(1,2,3,4,5)

(1, (2, 3, 4, 5))

# lambda

In [27]:
#syntax    #Anonyous
#lambda arguments: expression

In [ ]:
### They can only perform one expression. Itâ€™s not possible to have multiple independent operations in one lambda function.

In [15]:
lambda_function = lambda x,y : x*y

In [16]:
lambda_function(2,3)

6

In [30]:
add_lambda = lambda x,y:x+y

In [32]:
add_lambda(1,2)

3

In [4]:
(lambda x, y, z:(x+y)//z)(1,2,3)

1

In [61]:
x = {"Name":['Mahesh','Suresh','Harish'],"Age":[25,26,27],"weight":[60,65,70],"Height":[5.6,5.7,5.8]}

In [62]:
import pandas as pd

In [73]:
data = pd.DataFrame(x)

In [74]:
data

     Name  Age  weight  Height
0  Mahesh   25      60     5.6
1  Suresh   26      65     5.7
2  Harish   27      70     5.8

# Apply

In [ ]:
#syntax
Apply(function Arguments:expression)

In [75]:
data['Age_multi'] = data['Age'].apply(lambda x:x*x)

In [76]:
data

     Name  Age  weight  Height  Age_multi
0  Mahesh   25      60     5.6        625
1  Suresh   26      65     5.7        676
2  Harish   27      70     5.8        729

In [78]:
data['w_class'] = data['weight'].apply(lambda x: 'Over weight' if x>=70 else 'Normal weight')

In [79]:
data

     Name  Age  weight  Height  Age_multi        w_class
0  Mahesh   25      60     5.6        625  Normal weight
1  Suresh   26      65     5.7        676  Normal weight
2  Harish   27      70     5.8        729    Over weight

In [1]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Luke','Gina','Sam','Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016],
})

In [2]:
df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

In [3]:
df['age'] = df['Birthyear'].apply(lambda x: 2021-x)

In [4]:
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

In [10]:
#Conditional Lambda statement
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')

In [11]:
df['Status'].unique()

array(['Father', 'Mother', 'Son', 'Daughter'], dtype=object)

In [12]:
df

   Name    Status  Birthyear  age  Gender
0  Luke    Father       1976   45    Male
1  Gina    Mother       1984   37  Female
2   Sam       Son       2013    8    Male
3  Emma  Daughter       2016    5  Female

# Map

In [14]:
#syntax map(function, sequence)
#inbuilt python library
#This returns a modified list where every value in the original list has been changed based on a function.

In [18]:
list_1 = [1,2,3,4,5,6,7,8,9]
cubed = map(lambda x: pow(x,3), list_1)

In [19]:
list(cubed)

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [20]:
list(cubed)

[]

In [28]:
a = [1,2,3,4,5]

In [30]:
list(map(abs,a))

[1, 2, 3, 4, 5]

In [52]:
list(map(lambda x: x*x, a))

[1, 4, 9, 16, 25]

In [80]:
data

     Name  Age  weight  Height  Age_multi        w_class
0  Mahesh   25      60     5.6        625  Normal weight
1  Suresh   26      65     5.7        676  Normal weight
2  Harish   27      70     5.8        729    Over weight

In [81]:
data['h_class'] = data['Height'].map(lambda x: "Good" if x>=5.8 else "Avg")

In [82]:
data

     Name  Age  weight  Height  Age_multi        w_class h_class
0  Mahesh   25      60     5.6        625  Normal weight     Avg
1  Suresh   26      65     5.7        676  Normal weight     Avg
2  Harish   27      70     5.8        729    Over weight    Good

In [84]:
x = {"A":[1,2,3,4,5,6,7],"B":[2,3,4,5,6,7,8],"C":[3,4,5,6,7,8,9]}

In [86]:
data1 = pd.DataFrame(x)

In [87]:
data1

   A  B  C
0  1  2  3
1  2  3  4
2  3  4  5
3  4  5  6
4  5  6  7
5  6  7  8
6  7  8  9

In [97]:
len(data1)

7

In [107]:
def Calc(a,b,c):
    d=(a-b)/c
    return d

In [110]:
Calc(data1.A,data1.B,data1.C)

0   -0.333333
1   -0.250000
2   -0.200000
3   -0.166667
4   -0.142857
5   -0.125000
6   -0.111111
dtype: float64

In [112]:
data1['calc_col'] = Calc(data1.A,data1.B,data1.C)

In [113]:
data1

   A  B  C  calc_col
0  1  2  3 -0.333333
1  2  3  4 -0.250000
2  3  4  5 -0.200000
3  4  5  6 -0.166667
4  5  6  7 -0.142857
5  6  7  8 -0.125000
6  7  8  9 -0.111111

# Filter()

#This is a Python inbuilt library that returns only those values that fit certain criteria. The syntax is filter(function, iterable). The iterable can be any sequence such as a list, set, or series object

In [6]:
list_1 = [1,2,3,4,5,6,7,8,9]

In [12]:
filter(lambda x: x%2==0, list_1)

In [13]:
list(filter(lambda x: x%2==0, list_1))

[2, 4, 6, 8]

In [24]:
#referring to df
list(filter(lambda x: x>18, df['age']))

[45, 37]

# list comprehensions

##### List comprehensions are a tool for transforming one list (any iterable actually) into another list. During this transformation, elements can be conditionally included in the new list and each element can be transformed as needed.

In [32]:
numbers = [1,2,3,4,5,6,7,8,9,10]

doubled_odds = map(lambda n: n * 2, filter(lambda n: n % 2 == 1, numbers))

In [34]:
list(doubled_odds)

[2, 6, 10, 14, 18]

In [35]:
doubled_odds = [n * 2 for n in numbers if n % 2 == 1]

In [36]:
list(doubled_odds)

[2, 6, 10, 14, 18]

In [37]:
1%2

1

In [1]:
x = {"Name":['Mahesh','Suresh','Harish'],"Age":[25,26,27],"weight":[60,65,70],"Height":[5.6,5.7,5.8]}

In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(x)

In [6]:
df

     Name  Age  weight  Height
0  Mahesh   25      60     5.6
1  Suresh   26      65     5.7
2  Harish   27      70     5.8

In [7]:
df.columns

Index(['Name', 'Age', 'weight', 'Height'], dtype='object')

In [8]:
df['new_column'] =  df[['Age','weight']].apply(lambda x,y : x*y)

TypeError: <lambda>() missing 1 required positional argument: 'y'

In [9]:
def mult(a,b):
    return a*b

In [14]:
df.apply(lambda x : mult(x['Age'], x['weight']), axis=1)

0    1500
1    1690
2    1890
dtype: int64

In [15]:
df.corr()['weight']

Age       1.0
weight    1.0
Height    1.0
Name: weight, dtype: float64

In [22]:
[df['Age']*df['weight'] for x,y in df]

ValueError: too many values to unpack (expected 2)

In [23]:
df_columns = list(df.columns.values)

In [28]:
[mult(df['Age'],df['weight'])  for x,y in df.columns]

ValueError: too many values to unpack (expected 2)

In [30]:
df.apply(lambda x : mult(x['Age'],x['weight']),axis=1)

0    1500
1    1690
2    1890
dtype: int64

In [35]:
df_columns = list(df.columns.values)
[mult(df['Age'],df['weight']) for a,b in range(0 , len[df.columns])]

TypeError: 'builtin_function_or_method' object is not subscriptable